Repository: Drogonov/ultimate-hello-world-ios
Catalog: HelloWorldApp/Resources/Resources/Localization/*.lproj/Localizable.strings
Languages: ru

# error_with_trace_id
source: %@ Error Code: %@
ru: %@ Код ошибки: %@

# error_empty_data
source: Request %@ responded with empty data
ru: Request %@ respond with empty data

# error_convertation_nil
source: Failed to convert response from %@ to JSON completely. Received nil at the end of conversion
ru: Failed to convert response from %@ to JSON in total. Get nil at the end of conversion

# internet_not_available_title
source: Internet Connection Issue
ru: Проблема с подключением к интернету

# internet_not_available_message
source: Connect to another network, check the internet and try again
ru: Подключитесь к другой сети, проверьте интернет и повторите попытку

# internet_not_available
source: Internet is unavailable
ru: Интернет недоступен

# server_inaccessible
source: Sorry, a request error occurred, please try again later
ru: Извините, произошла ошибка выполнения запроса, попробуйте повторить действие позже

# server_inaccessible_title
source: Application is temporarily unavailable
ru: Приложение временно недоступно

# server_inaccessible_message
source: Reload it and try logging in later
ru: Перезагрузите его и повторите попытку входа позже

# unknown_error
source: Functionality is temporarily unavailable
ru: Функциональность временно недоступна

# functionality_unavailable
source: Functionality is unavailable
ru: Функциональность недоступна

# forbidden_error_default_message
source: Functionality is unavailable
ru: Функциональность недоступна

source: Ok
ru: ок

source: Attention!
ru: Внимание!

source: Refresh
ru: Обновить

source: Clear
ru: Понятно

source: Cancel
ru: Отмена

source: Change
ru: Изменить

# app_outdated
source: Your current version of the application is not supported. The application needs to be updated
ru: Ваша текущая версия приложения не поддерживается. Необходимо обновить приложение

# hello_world_title
source: Hello World
ru: Привет Мир

# hello_world_text
source: Hello World
ru: Привет Мир

# hello_world_button_title
source: Hello World
ru: Привет Мир

# change_language_title
source: Change Language
ru: Привет Мир

# change_language_text
source: Change Language
ru: Привет Мир
